nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso54s018/usb_examples/usb_host_audio_recorder/freertos/pin_mux.c
    const uint32_t port2_pin8_config = (/* Pin is configured as SD_D(2) */
                                        IOCON_PIO_FUNC2 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Fast mode, slew rate control is disabled */
                                        IOCON_PIO_SLEW_FAST |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN8 (coords: F4) is configured as SD_D(2) */
    IOCON_PinMuxSet(IOCON, 2U, 8U, port2_pin8_config);

    const uint32_t port2_pin9_config = (/* Pin is configured as SD_D(3) */
                                        IOCON_PIO_FUNC2 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Fast mode, slew rate control is disabled */
                                        IOCON_PIO_SLEW_FAST |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT2 PIN9 (coords: K2) is configured as SD_D(3) */
    IOCON_PinMuxSet(IOCON, 2U, 9U, port2_pin9_config);

    const uint32_t port3_pin15_config = (/* Pin is configured as SD_WR_PRT */
                                         IOCON_PIO_FUNC2 |
                                         /* No addition pin function */
                                         IOCON_PIO_MODE_INACT |
                                         /* Input function is not inverted */
                                         IOCON_PIO_INV_DI |
                                         /* Enables digital function */
                                         IOCON_PIO_DIGITAL_EN |
                                         /* Input filter disabled */
                                         IOCON_PIO_INPFILT_OFF |
                                         /* Standard mode, output slew rate control is enabled */
                                         IOCON_PIO_SLEW_STANDARD |
                                         /* Open drain is disabled */
                                         IOCON_PIO_OPENDRAIN_DI);
    /* PORT3 PIN15 (coords: D2) is configured as SD_WR_PRT */
    IOCON_PinMuxSet(IOCON, 3U, 15U, port3_pin15_config);

    const uint32_t port4_pin7_config = (/* Pin is configured as USB0_PORTPWRN */
                                        IOCON_PIO_FUNC3 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN7 (coords: A14) is configured as USB0_PORTPWRN */
    IOCON_PinMuxSet(IOCON, 4U, 7U, port4_pin7_config);

    const uint32_t port4_pin8_config = (/* Pin is configured as USB0_OVERCURRENTN */
                                        IOCON_PIO_FUNC3 |
                                        /* No addition pin function */
                                        IOCON_PIO_MODE_INACT |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN8 (coords: B14) is configured as USB0_OVERCURRENTN */
    IOCON_PinMuxSet(IOCON, 4U, 8U, port4_pin8_config);

    const uint32_t port4_pin9_config = (/* Pin is configured as USB1_PORTPWRN */
                                        IOCON_PIO_FUNC3 |
                                        /* Selects pull-up function */
                                        IOCON_PIO_MODE_PULLUP |
                                        /* Input function is not inverted */
                                        IOCON_PIO_INV_DI |
                                        /* Enables digital function */
                                        IOCON_PIO_DIGITAL_EN |
                                        /* Input filter disabled */
                                        IOCON_PIO_INPFILT_OFF |
                                        /* Standard mode, output slew rate control is enabled */
                                        IOCON_PIO_SLEW_STANDARD |
                                        /* Open drain is disabled */
                                        IOCON_PIO_OPENDRAIN_DI);
    /* PORT4 PIN9 (coords: A12) is configured as USB1_PORTPWRN */
    IOCON_PinMuxSet(IOCON, 4U, 9U, port4_pin9_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
